espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_class_hid.h
/***************************************************************************//**
 * @file
 * @brief USB Device HID Class
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/****************************************************************************************************//**
 * @defgroup USBD_HID USB Device HID API
 * @ingroup USBD
 * @brief   USB Device HID API
 *
 * @addtogroup USBD_HID
 * @{
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               MODULE
 ********************************************************************************************************
 *******************************************************************************************************/

#ifndef  SL_USBD_CLASS_HID_H
#define  SL_USBD_CLASS_HID_H

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#include <stdint.h>
#include <stdbool.h>

#include "sl_enum.h"

#include "sl_usbd_core.h"

/********************************************************************************************************
 ********************************************************************************************************
 *                                               EXTERNS
 ********************************************************************************************************
 *******************************************************************************************************/

#ifdef  SLI_USBD_HID_MODULE
#define  SLI_USBD_HID_EXTERN
#else
#define  SLI_USBD_HID_EXTERN  extern
#endif

/********************************************************************************************************
 ********************************************************************************************************
 *                                               DEFINES
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                          HUMAN INTERFACE DEVICE COUNTRY CODES DEFINES
 *
 * Note(s) : (1) See 'Device Class Definition for Human Interface Devices (HID), 6/27/01, Version 1.11',
 *               section 6.2.1 for more details about HID descriptor country code.
 *
 *               (a) The country code identifies which country the hardware is localized for. Most
 *                   hardware is not localized and thus this value would be zero (0). However, keyboards
 *                   may use the field to indicate the language of the key caps.
 *******************************************************************************************************/

SL_ENUM(sl_usbd_hid_country_code_t) {
  SL_USBD_HID_COUNTRY_CODE_NOT_SUPPORTED = 0u,                     // See Note #1a.
  SL_USBD_HID_COUNTRY_CODE_ARABIC = 1u,
  SL_USBD_HID_COUNTRY_CODE_BELGIAN = 2u,
  SL_USBD_HID_COUNTRY_CODE_CANADIAN_BILINGUAL = 3u,
  SL_USBD_HID_COUNTRY_CODE_CANADIAN_FRENCH = 4u,
  SL_USBD_HID_COUNTRY_CODE_CZECH_REPUBLIC = 5u,
  SL_USBD_HID_COUNTRY_CODE_DANISH = 6u,
  SL_USBD_HID_COUNTRY_CODE_FINNISH = 7u,
  SL_USBD_HID_COUNTRY_CODE_FRENCH = 8u,
  SL_USBD_HID_COUNTRY_CODE_GERMAN = 9u,
  SL_USBD_HID_COUNTRY_CODE_GREEK = 10u,
  SL_USBD_HID_COUNTRY_CODE_HEBREW = 11u,
  SL_USBD_HID_COUNTRY_CODE_HUNGARY = 12u,
  SL_USBD_HID_COUNTRY_CODE_INTERNATIONAL = 13u,
  SL_USBD_HID_COUNTRY_CODE_ITALIAN = 14u,
  SL_USBD_HID_COUNTRY_CODE_JAPAN_KATAKANA = 15u,
  SL_USBD_HID_COUNTRY_CODE_KOREAN = 16u,
  SL_USBD_HID_COUNTRY_CODE_LATIN_AMERICAN = 17u,
  SL_USBD_HID_COUNTRY_CODE_NETHERLANDS_DUTCH = 18u,
  SL_USBD_HID_COUNTRY_CODE_NORWEGIAN = 19u,
  SL_USBD_HID_COUNTRY_CODE_PERSIAN_FARSI = 20u,
  SL_USBD_HID_COUNTRY_CODE_POLAND = 21u,
  SL_USBD_HID_COUNTRY_CODE_PORTUGUESE = 22u,
  SL_USBD_HID_COUNTRY_CODE_RUSSIA = 23u,
  SL_USBD_HID_COUNTRY_CODE_SLOVAKIA = 24u,
  SL_USBD_HID_COUNTRY_CODE_SPANISH = 25u,
  SL_USBD_HID_COUNTRY_CODE_SWEDISH = 26u,
  SL_USBD_HID_COUNTRY_CODE_SWISS_FRENCH = 27u,
  SL_USBD_HID_COUNTRY_CODE_SWISS_GERMAN = 28u,
  SL_USBD_HID_COUNTRY_CODE_SWITZERLAND = 29u,
  SL_USBD_HID_COUNTRY_CODE_TAIWAN = 30u,
  SL_USBD_HID_COUNTRY_CODE_TURKISH_Q = 31u,
  SL_USBD_HID_COUNTRY_CODE_UK = 32u,
  SL_USBD_HID_COUNTRY_CODE_US = 33u,
  SL_USBD_HID_COUNTRY_CODE_YUGOSLAVIA = 34u,
  SL_USBD_HID_COUNTRY_CODE_TURKISH_F = 35u
};

/********************************************************************************************************
 *                           HUMAN INTERFACE DEVICE CLASS SUBCLASS CODES DEFINES
 *
 * Note(s) : (1) Human interface device class subclass codes are defined in section 4.2 of HID
 *               specification revision 1.11.
 *******************************************************************************************************/

#define  SL_USBD_HID_SUBCLASS_NONE                        0x00u    // No subclass.
#define  SL_USBD_HID_SUBCLASS_BOOT                        0x01u    // Boot interface.

/********************************************************************************************************
 *                           HUMAN INTERFACE DEVICE CLASS PROTOCOL CODES DEFINES
 *
 * Note(s) : (1) Human interface device class protocol codes are defined in section 4.3 of HID
 *               specification revision 1.11.
 *******************************************************************************************************/

#define  SL_USBD_HID_PROTOCOL_NONE                        0x00u    // No class specific protocol.
#define  SL_USBD_HID_PROTOCOL_KBD                         0x01u    // Keyboard protocol.
#define  SL_USBD_HID_PROTOCOL_MOUSE                       0x02u    // Mouse protocol.

/********************************************************************************************************
 *                                          ITEM TYPES
 *******************************************************************************************************/

