espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_class_hid.h
// HID Report Descriptor
#define  SL_USBD_HID_ITEM_LONG                             0xFE
// Short item types
#define  SL_USBD_HID_ITEM_TYPE_MAIN                        0x00
#define  SL_USBD_HID_ITEM_TYPE_GLOBAL                      0x04
#define  SL_USBD_HID_ITEM_TYPE_LOCAL                       0x08
#define  SL_USBD_HID_ITEM_TYPE_RESERVED                    0x0C
// Main item
#define  SL_USBD_HID_MAIN_INPUT                            0x80
#define  SL_USBD_HID_MAIN_OUTPUT                           0x90
#define  SL_USBD_HID_MAIN_COLLECTION                       0xA0
#define  SL_USBD_HID_MAIN_FEATURE                          0xB0
#define  SL_USBD_HID_MAIN_ENDCOLLECTION                    0xC0
// Input/output/feature item
#define  SL_USBD_HID_MAIN_CONSTANT                         0x01
#define  SL_USBD_HID_MAIN_DATA                             0x00
#define  SL_USBD_HID_MAIN_VARIABLE                         0x02
#define  SL_USBD_HID_MAIN_ARRAY                            0x00
#define  SL_USBD_HID_MAIN_RELATIVE                         0x04
#define  SL_USBD_HID_MAIN_ABSOLUTE                         0x00
#define  SL_USBD_HID_MAIN_WRAP                             0x08
#define  SL_USBD_HID_MAIN_NOWRAP                           0x00
#define  SL_USBD_HID_MAIN_NONLINEAR                        0x10
#define  SL_USBD_HID_MAIN_LINEAR                           0x00
#define  SL_USBD_HID_MAIN_NOPREFERRED                      0x20
#define  SL_USBD_HID_MAIN_PREFERREDSTATE                   0x00
#define  SL_USBD_HID_MAIN_NULLSTATE                        0x40
#define  SL_USBD_HID_MAIN_NONULLPOSITION                   0x00
#define  SL_USBD_HID_MAIN_VOLATILE                         0x80
#define  SL_USBD_HID_MAIN_NONVOLATILE                      0x00
#define  SL_USBD_HID_MAIN_BUFFEREDBYTES                  0x0100
#define  SL_USBD_HID_MAIN_BITFIELD                       0x0000
// Collection item
#define  SL_USBD_HID_COLLECTION_PHYSICAL                   0x00
#define  SL_USBD_HID_COLLECTION_APPLICATION                0x01
#define  SL_USBD_HID_COLLECTION_LOGICAL                    0x02
#define  SL_USBD_HID_COLLECTION_REPORT                     0x03
#define  SL_USBD_HID_COLLECTION_NAMEDARRAY                 0x04
#define  SL_USBD_HID_COLLECTION_USAGESWITCH                0x05
#define  SL_USBD_HID_COLLECTION_USAGEMODIFIER              0x06
// Global item
#define  SL_USBD_HID_GLOBAL_USAGE_PAGE                     0x04
#define  SL_USBD_HID_GLOBAL_LOG_MIN                        0x14
#define  SL_USBD_HID_GLOBAL_LOG_MAX                        0x24
#define  SL_USBD_HID_GLOBAL_PHY_MIN                        0x34
#define  SL_USBD_HID_GLOBAL_PHY_MAX                        0x44
#define  SL_USBD_HID_GLOBAL_UNIT_EXPONENT                  0x54
#define  SL_USBD_HID_GLOBAL_UNIT                           0x64
#define  SL_USBD_HID_GLOBAL_REPORT_SIZE                    0x74
#define  SL_USBD_HID_GLOBAL_REPORT_ID                      0x84
#define  SL_USBD_HID_GLOBAL_REPORT_COUNT                   0x94
#define  SL_USBD_HID_GLOBAL_PUSH                           0xA4
#define  SL_USBD_HID_GLOBAL_POP                            0xB4
// Local item
#define  SL_USBD_HID_LOCAL_USAGE                           0x08
#define  SL_USBD_HID_LOCAL_USAGE_MIN                       0x18
#define  SL_USBD_HID_LOCAL_USAGE_MAX                       0x28
#define  SL_USBD_HID_LOCAL_DESIGNATOR_INDEX                0x38
#define  SL_USBD_HID_LOCAL_DESIGNATOR_MIN                  0x48
#define  SL_USBD_HID_LOCAL_DESIGNATOR_MAX                  0x58
#define  SL_USBD_HID_LOCAL_STRING_INDEX                    0x78
#define  SL_USBD_HID_LOCAL_STRING_MIN                      0x88
#define  SL_USBD_HID_LOCAL_STRING_MAX                      0x98
#define  SL_USBD_HID_LOCAL_DELIMITER                       0xA8

/****************************************************************************************************//**
 *                                   HID PHYSICAL DESCRIPTOR DEFINES
 *
 * Note(s) : (1) See 'Device Class Definition for Human Interface Devices Version 1.11', Section 6.2.3.
 *******************************************************************************************************/

// HID Physical Descriptor (see Note #1)
// Bias values.
#define  SL_USBD_HID_BIAS_NOT_APPLICABLE                      0
#define  SL_USBD_HID_BIAS_RIGHT_HAND                          1
#define  SL_USBD_HID_BIAS_LEFT_HAND                           2
#define  SL_USBD_HID_BIAS_BOTH_HANDS                          3
#define  SL_USBD_HID_BIAS_EITHER_HAND                         4
// Designator values.
#define  SL_USBD_HID_DESIGNATOR_NONE                       0x00
#define  SL_USBD_HID_DESIGNATOR_HAND                       0x01
#define  SL_USBD_HID_DESIGNATOR_EYEBALL                    0x02
#define  SL_USBD_HID_DESIGNATOR_EYEBROW                    0x03
#define  SL_USBD_HID_DESIGNATOR_EYELID                     0x04
#define  SL_USBD_HID_DESIGNATOR_EAR                        0x05
#define  SL_USBD_HID_DESIGNATOR_NOSE                       0x06
#define  SL_USBD_HID_DESIGNATOR_MOUTH                      0x07
#define  SL_USBD_HID_DESIGNATOR_UPPER_LIP                  0x08
#define  SL_USBD_HID_DESIGNATOR_LOWER_LIP                  0x09
#define  SL_USBD_HID_DESIGNATOR_JAW                        0x0A
#define  SL_USBD_HID_DESIGNATOR_NECK                       0x0B
#define  SL_USBD_HID_DESIGNATOR_UPPER_ARM                  0x0C
#define  SL_USBD_HID_DESIGNATOR_ELBOW                      0x0D
#define  SL_USBD_HID_DESIGNATOR_FOREARM                    0x0E
#define  SL_USBD_HID_DESIGNATOR_WRIST                      0x0F
#define  SL_USBD_HID_DESIGNATOR_PALM                       0x10
#define  SL_USBD_HID_DESIGNATOR_THUMB                      0x11
#define  SL_USBD_HID_DESIGNATOR_INDEX_FINGER               0x12
#define  SL_USBD_HID_DESIGNATOR_MIDDLE_FINGER              0x13
#define  SL_USBD_HID_DESIGNATOR_RING_FINGER                0x14
#define  SL_USBD_HID_DESIGNATOR_LITTLE_FINGER              0x15
#define  SL_USBD_HID_DESIGNATOR_HEAD                       0x16
#define  SL_USBD_HID_DESIGNATOR_SHOULDER                   0x17
#define  SL_USBD_HID_DESIGNATOR_HIP                        0x18
#define  SL_USBD_HID_DESIGNATOR_WAIST                      0x19
#define  SL_USBD_HID_DESIGNATOR_THIGH                      0x1A
#define  SL_USBD_HID_DESIGNATOR_KNEE                       0x1B
#define  SL_USBD_HID_DESIGNATOR_CALF                       0x1C
#define  SL_USBD_HID_DESIGNATOR_ANKLE                      0x1D
#define  SL_USBD_HID_DESIGNATOR_FOOT                       0x1E
#define  SL_USBD_HID_DESIGNATOR_HEEL                       0x1F
#define  SL_USBD_HID_DESIGNATOR_BALL_OF_FOOT               0x20
#define  SL_USBD_HID_DESIGNATOR_BIG_TOE                    0x21
#define  SL_USBD_HID_DESIGNATOR_SECOND_TOE                 0x22
#define  SL_USBD_HID_DESIGNATOR_THIRD_TOE                  0x23
#define  SL_USBD_HID_DESIGNATOR_FOURTH_TOE                 0x24
#define  SL_USBD_HID_DESIGNATOR_LITTLE_TOE                 0x25
#define  SL_USBD_HID_DESIGNATOR_BROW                       0x26
#define  SL_USBD_HID_DESIGNATOR_CHEEK                      0x27
// Qualifier values.
#define  SL_USBD_HID_QUALIFIER_NOT_APPLICABLE                 0
#define  SL_USBD_HID_QUALIFIER_RIGHT                          1
#define  SL_USBD_HID_QUALIFIER_LEFT                           2
#define  SL_USBD_HID_QUALIFIER_BOTH                           3
#define  SL_USBD_HID_QUALIFIER_EITHER                         4
#define  SL_USBD_HID_QUALIFIER_CENTER                         5

/****************************************************************************************************//**
 *                                           HID USAGE PAGES
 *
 * Note(s) : (1) See 'Universal Serial Bus HID Usage Tables', Version 1.12, Section 3 for more details
 *               about Usage Pages.
 *
 *           (2) See 'Universal Serial Bus HID Usage Tables', Version 1.12, Section 4 for more details
 *               about Generic Desktop Page usages and controls.
 *******************************************************************************************************/
// Usage Pages (see Note #1)
#define  SL_USBD_HID_USAGE_PAGE_UNDEFINED                  0x00
#define  SL_USBD_HID_USAGE_PAGE_GENERIC_DESKTOP_CONTROLS   0x01
#define  SL_USBD_HID_USAGE_PAGE_SIMULATION_CONTROLS        0x02
#define  SL_USBD_HID_USAGE_PAGE_VR_CONTROLS                0x03
#define  SL_USBD_HID_USAGE_PAGE_SPORT_CONTROLS             0x04
#define  SL_USBD_HID_USAGE_PAGE_GAME_CONTROLS              0x05
#define  SL_USBD_HID_USAGE_PAGE_GENERIC_DEVICE_CONTROLS    0x06
#define  SL_USBD_HID_USAGE_PAGE_KEYBOARD                   0x07
#define  SL_USBD_HID_USAGE_PAGE_LEDS                       0x08
#define  SL_USBD_HID_USAGE_PAGE_BUTTON                     0x09
#define  SL_USBD_HID_USAGE_PAGE_ORDINAL                    0x0A
#define  SL_USBD_HID_USAGE_PAGE_TELEPHONY                  0x0B
#define  SL_USBD_HID_USAGE_PAGE_CONSUMER                   0x0C
#define  SL_USBD_HID_USAGE_PAGE_DIGITIZER                  0x0D
#define  SL_USBD_HID_USAGE_PAGE_PID_PAGE                   0x0F
#define  SL_USBD_HID_USAGE_PAGE_UNICODE                    0x10
#define  SL_USBD_HID_USAGE_PAGE_ALPHANUMERIC_DISPLAY       0x14
#define  SL_USBD_HID_USAGE_PAGE_MEDICAL_INSTRUMENTS        0x40
#define  SL_USBD_HID_USAGE_PAGE_MONITOR_0                  0x80
#define  SL_USBD_HID_USAGE_PAGE_MONITOR_1                  0x81
#define  SL_USBD_HID_USAGE_PAGE_MONITOR_2                  0x82
#define  SL_USBD_HID_USAGE_PAGE_MONITOR_3                  0x83
#define  SL_USBD_HID_USAGE_PAGE_POWER_0                    0x84
#define  SL_USBD_HID_USAGE_PAGE_POWER_1                    0x85
#define  SL_USBD_HID_USAGE_PAGE_POWER_2                    0x86
#define  SL_USBD_HID_USAGE_PAGE_POWER_3                    0x87
#define  SL_USBD_HID_USAGE_PAGE_BAR_CODE_SCANNER_PAGE      0x8C
#define  SL_USBD_HID_USAGE_PAGE_SCALE_PAGE                 0x8D
#define  SL_USBD_HID_USAGE_PAGE_MSR_DEVICES                0x8E
#define  SL_USBD_HID_USAGE_PAGE_POINT_OF_SALE_PAGES        0x8F
#define  SL_USBD_HID_USAGE_PAGE_CAMERA_CONTROL_PAGE        0x90
#define  SL_USBD_HID_USAGE_PAGE_ARCADE_PAGE                0x91

