espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_class_hid.h
// Generic Desktop Page Usages & Control
// See Note #2.
#define  SL_USBD_HID_CP_POINTER                            0x01
#define  SL_USBD_HID_CA_MOUSE                              0x02
#define  SL_USBD_HID_CA_JOYSTICK                           0x04
#define  SL_USBD_HID_CA_GAME_PAD                           0x05
#define  SL_USBD_HID_CA_KEYBOARD                           0x06
#define  SL_USBD_HID_CA_KEYPAD                             0x07
#define  SL_USBD_HID_CA_MULTI_AXIS_CONTROLLER              0x08
#define  SL_USBD_HID_DV_X                                  0x30
#define  SL_USBD_HID_DV_Y                                  0x31
#define  SL_USBD_HID_DV_Z                                  0x32
#define  SL_USBD_HID_DV_WHEEL                              0x38
#define  SL_USBD_HID_CA_SYSTEM_CONTROL                     0x80

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL CONSTANTS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               DATA TYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/// Async comm callback
typedef void (*sl_usbd_hid_async_function_t)(uint8_t      class_nbr,
                                             void         *p_buf,
                                             uint32_t     buf_len,
                                             uint32_t     xfer_len,
                                             void         *p_callback_arg,
                                             sl_status_t  status);

/// HID callbacks
typedef const struct {
  void (*enable)(uint8_t class_nbr);                        ///< Callback for enable event

  void (*disable)(uint8_t class_nbr);                       ///< Callback for disable event

  void (*get_report_desc)(uint8_t         class_nbr,
                          const uint8_t   **p_report_ptr,
                          uint16_t        *p_report_len);   ///< Callback for get report descriptor event

  void (*get_phy_desc)(uint8_t         class_nbr,
                       const uint8_t   **p_report_ptr,
                       uint16_t        *p_report_len);      ///< Callback for get physical descriptor event

  void (*set_output_report)(uint8_t  class_nbr,
                            uint8_t  report_id,
                            uint8_t  *p_report_buf,
                            uint16_t report_len);           ///< Callback for set output report event

  void (*get_feature_report)(uint8_t  class_nbr,
                             uint8_t  report_id,
                             uint8_t  *p_report_buf,
                             uint16_t report_len);          ///< Callback for get feature report event

  void (*set_feature_report)(uint8_t  class_nbr,
                             uint8_t  report_id,
                             uint8_t  *p_report_buf,
                             uint16_t report_len);          ///< Callback for set feature report event

  void (*get_protocol)(uint8_t  class_nbr,
                       uint8_t  *p_protocol);               ///< Callback for get protocol event

  void (*set_protocol)(uint8_t class_nbr,
                       uint8_t protocol);                   ///< Callback for set protocol event
} sl_usbd_hid_callbacks_t;

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL CONSTANTS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                           FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/********************************************************************************************************
 *                                               HID FUNCTIONS
 *******************************************************************************************************/

/****************************************************************************************************//**
 * @brief    Initialize HID class.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_init(void);

/****************************************************************************************************//**
 * @brief   Add a new instance of the HID class.
 *
 * @param   subclass            Subclass code.
 *
 * @param   protocol            protocol code.
 *
 * @param   country_code        Country code id.
 *
 * @param   interval_in         Polling interval for input transfers, in milliseconds.
 *                              It must be a power of 2.
 *
 * @param   interval_out        Polling interval for output transfers, in milliseconds.
 *                              It must be a power of 2. Used only when read operations are not
 *                              through control transfers.
 *
 * @param   ctrl_rd_en          Enable read operations through the control transfers.
 *
 * @param   p_hid_callbacks     Pointer to HID descriptor and request callback structure.
 *                              [Content MUST be persistent]
 *
 * @param   p_class_nbr         Pointer to variable that will receive class instance number.
 *                              The variable is set to class instance number if no errors are returned,
 *                              otherwise it is set to SL_USBD_CLASS_NBR_NONE.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_create_instance(uint8_t                     subclass,
                                        uint8_t                     protocol,
                                        sl_usbd_hid_country_code_t  country_code,
                                        uint16_t                    interval_in,
                                        uint16_t                    interval_out,
                                        bool                        ctrl_rd_en,
                                        sl_usbd_hid_callbacks_t     *p_hid_callbacks,
                                        uint8_t                     *p_class_nbr);

/****************************************************************************************************//**
 * @brief    Add the HID class instance to the USB device configuration (see Note #1).
 *
 * @param    class_nbr   Class instance number.
 *
 * @param    config_nbr  Configuration index to add HID class instance to.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Called several times, it creates multiple instances and configurations.
 *               For instance, the following architecture could be created :
 *               @verbatim
 *               FS
 *               |-- Configuration 0 (HID class 0)
 *                                   (HID class 1)
 *                                   (HID class 2)
 *                   |-- Interface 0
 *               |-- Configuration 1 (HID class 0)
 *                   |-- Interface 0
 *               @endverbatim
 *
 * @note     (2) Configuration Descriptor corresponding to a HID device uses the following format :
 *               @verbatim
 *               Configuration Descriptor
 *               |-- Interface Descriptor (HID class)
 *                   |-- Endpoint Descriptor (Interrupt IN)
 *                   |-- Endpoint Descriptor (Interrupt OUT) - optional
 *               @endverbatim
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_add_to_configuration(uint8_t  class_nbr,
                                             uint8_t  config_nbr);

/****************************************************************************************************//**
 * @brief    Get the HID class enable state.
 *
 * @param    class_nbr   Class instance number.
 *
 * @param    p_enabled   Pointer to a variable that will receive HID class enable state.
 *                       The variable is set to true if HID class is enabled,
 *                       and is set to false if it is NOT enabled.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_is_enabled(uint8_t  class_nbr,
                                   bool     *p_enabled);

/****************************************************************************************************//**
 * @brief    Send data to the host through the Interrupt IN endpoint. This function is blocking.
 *
 * @param    class_nbr   Class instance number.
 *
 * @param    p_buf       Pointer to the transmit buffer. If more than one input report exists, the first
 *                       byte must represent the report id.
 *
 * @param    buf_len     Transmit buffer length, in octets.
 *
 * @param    timeout     Timeout in milliseconds.
 *
 * @param    p_xfer_len  Pointer to a variable that will receive transfer length.
 *                       The variable is set to number of octets received, if no errors are returned,
 *                       or is set to 0 if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_write_sync(uint8_t    class_nbr,
                                   void       *p_buf,
                                   uint32_t   buf_len,
                                   uint16_t   timeout,
                                   uint32_t   *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Receive data from the host through the Interrupt OUT endpoint. This function is blocking.
 *
 * @param    class_nbr   Class instance number.
 *
 * @param    p_buf       Pointer to the receive buffer.
 *
 * @param    buf_len     Receive the buffer length, in octets.
 *
 * @param    timeout     Timeout, in milliseconds.
 *
 * @param    p_xfer_len  Pointer to a variable that will receive transfer length.
 *                       The variable is set to number of octets received, if no errors are returned,
 *                       or is set to 0 if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 ***********************************************************************************************/
sl_status_t sl_usbd_hid_read_sync(uint8_t    class_nbr,
                                  void       *p_buf,
                                  uint32_t   buf_len,
                                  uint16_t   timeout,
                                  uint32_t   *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Receive data from the host through the Interrupt OUT endpoint. This function is non-blocking
 *           and returns immediately after transfer preparation. Upon transfer completion, the provided
 *           callback is called to notify the application.
 *
 * @param    class_nbr       Class instance number.
 *
 * @param    p_buf           Pointer to receive buffer.
 *
 * @param    buf_len         Receive buffer length, in octets.
 *
 * @param    async_fnct      Receive callback.
 *
 * @param    p_async_arg     Additional argument provided by application for receive callback.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_read_async(uint8_t                      class_nbr,
                                   void                         *p_buf,
                                   uint32_t                     buf_len,
                                   sl_usbd_hid_async_function_t async_fnct,
                                   void                         *p_async_arg);

/****************************************************************************************************//**
 * @brief    Send data to the host through the Interrupt IN endpoint. This function is non-blocking,
 *           and returns immediately after transfer preparation. Upon transfer completion, the provided
 *           callback is called to notify the application.
 *
 * @param    class_nbr       Class instance number.
 *
 * @param    p_buf           Pointer to transmit buffer. If more than one input report exists, the first
 *                           byte must represent the report id.
 *
 * @param    buf_len         Transmit buffer length, in octets.
 *
 * @param    async_fnct      Transmit callback.
 *
 * @param    p_async_arg     Additional argument provided by application for transmit callback.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_write_async(uint8_t                      class_nbr,
                                    void                         *p_buf,
                                    uint32_t                     buf_len,
                                    sl_usbd_hid_async_function_t async_fnct,
                                    void                         *p_async_arg);

#ifdef __cplusplus
}
#endif

/****************************************************************************************************//**
 ********************************************************************************************************
 * @}                                          MODULE END
 ********************************************************************************************************
 *******************************************************************************************************/

#endif
